package com.langsin.oo.test2;

public class TestArray {

	/**
	 * 测试数组
	 * 1. 中括号的位置
	 * 2. 初始化方式   写法上不同，功能上一样。
	 * 3. 先定义，后赋值
	 */
	
	public static void main(String[] args) {
		int[] a = {1,2,3,4,5};
		int[] b = new int[]{1,2,3,4,5,6,7};
		int[] c = new int[10];	//定义一个长度为10的int类型的数组
		for(int i = 0;i<c.length;i++){
			c[i] = i;
		}
//		//显示这个c数组
//		for(int i = 0;i<c.length;i++){
//			System.out.println(c[i]);
//		}
		
//		System.out.println(c[c.length-1]);
		
		//二维数组    在形式上来说  有，在内存结构上来说，没有。
		int[][] as = {  {1,2,3},{4,5,6},{7,8,9}  };
		
		//为什么是255个？
		//slot  所有的变量存储的栈内存，
		int[][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][][] ass = {};
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
		
	}
}
